Revit 2026 API

# EnergyDataSettingsCheckExportCategory Method

---

Checks whether the export category falls within the list:

  1. OST_Rooms
  2. OST_MEPSpaces

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CheckExportCategory(
	ElementId exportCategoryId
)
```
```vb
Public Shared Function CheckExportCategory (
	exportCategoryId As ElementId
) As Boolean
```
```cpp
public:
static bool CheckExportCategory(
	ElementId^ exportCategoryId
)
```
```fsharp
static member CheckExportCategory :
        exportCategoryId : ElementId -> bool
```

#### Parameters

exportCategoryId ElementId
     The export category to be checked.

#### Return Value

Boolean True if the export category falls within the list, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace